In [1]:
import dask.dataframe as ddf
import pandas as pd
import datetime
import functools
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
sd = ddf.read_csv('pop_1969-2020.txt',sep = '\t', dtype = {'data': str})
sd = sd.compute()
sd = sd.loc[:, ~sd.columns.str.contains('^Unnamed')]
sd.head()

                         data
0  1969AL01001991910000000159
1  1969AL01001991910100000657
2  1969AL01001991910200001137
3  1969AL01001991910300000956
4  1969AL01001991910400000721

In [6]:
def findYear(data):
    return data[:4]

In [7]:
sd['year'] = sd['data'].apply(findYear)

In [8]:
def findState(data):
    return data[4:6]

In [9]:
sd['state'] = sd['data'].apply(findState)

In [10]:
def findCountyCode(data):
    return data[6:11]

In [11]:
sd['fips'] = sd['data'].apply(findCountyCode)

In [12]:
sd.head()

                         data  year state   fips
0  1969AL01001991910000000159  1969    AL  01001
1  1969AL01001991910100000657  1969    AL  01001
2  1969AL01001991910200001137  1969    AL  01001
3  1969AL01001991910300000956  1969    AL  01001
4  1969AL01001991910400000721  1969    AL  01001

In [17]:
str1 = '1969AL01001991910000000159'
print(str1[13])
print(str1[6:11])

1
01001

In [18]:
def findRace(data):
    code = ''
    if len(data) >= 14:
        code = data[13]
    race = ''
    if code == '1':
        race = 'white'
    elif code == '2':
        race = 'black'
    else:
        race = 'other'
    return race

In [19]:
sd['race'] = sd['data'].apply(findRace)

In [20]:
sd.head()

                         data  year state   fips   race
0  1969AL01001991910000000159  1969    AL  01001  white
1  1969AL01001991910100000657  1969    AL  01001  white
2  1969AL01001991910200001137  1969    AL  01001  white
3  1969AL01001991910300000956  1969    AL  01001  white
4  1969AL01001991910400000721  1969    AL  01001  white

In [21]:
race = list(sd['race'].unique())
for item in race:
    print(item)

white
black
other

In [28]:
def findOrigin(data):
    code = ''
    if len(data) >= 15:
        code = data[14]
    if code == '0':
        return 'Non-Hispanic'
    elif code == '1':
        return 'Hispanic'
    else:
        return 'not applicable'

In [29]:
sd['origin'] = sd['data'].apply(findOrigin)

In [30]:
sd['origin'].unique()

array(['not applicable'], dtype=object)

In [31]:
def findSex(data):
    code = ''
    if len(data) >= 16:
        code = data[15]
    if code == '1':
        return 'Male'
    else:
        return 'Female'

In [32]:
sd['sex'] = sd['data'].apply(findSex)

In [33]:
sd['sex'].unique()

array(['Male', 'Female'], dtype=object)

In [34]:
def findAge(data):
    code = ''
    if len(data) > 18:
        code = data[16:18]
    if code == '00':
        return '0 years'
    elif code == '01':
        return '1-4 years'
    elif code == '02':
        return '5-9 years'
    elif code == '03':
        return '10-14 years'
    elif code == '04':
        return '15-19 years'
    elif code == '05':
        return '20-24 years'
    elif code == '06':
        return '25-29 years'
    elif code == '07':
        return '30-34 years'
    elif code == '08':
        return '35-39 years'
    elif code == '09':
        return '40-44 years'
    elif code == '10':
        return '45-49 years'
    elif code == '11':
        return '50-54 years'
    elif code == '12':
        return '55-59 years'
    elif code == '13':
        return '60-64 years'
    elif code == '14':
        return '65-69 years'
    elif code == '15':
        return '70-74 years'
    elif code == '16':
        return '75-79 years'
    elif code == '17':
        return '80-84 years'
    else:
        return 'over 85 years'

In [35]:
sd['age'] = sd['data'].apply(findAge)

In [36]:
sd['age'].unique()

array(['0 years', '1-4 years', '5-9 years', '10-14 years', '15-19 years',
       '20-24 years', '25-29 years', '30-34 years', '35-39 years',
       '40-44 years', '45-49 years', '50-54 years', '55-59 years',
       '60-64 years', '65-69 years', '70-74 years', '75-79 years',
       '80-84 years', 'over 85 years'], dtype=object)

In [42]:
def findPop(data):
    code = ''
    if len(data) == 25 or len(data) == 26:
        code = data[18:]
    return code.strip('0')

In [43]:
sd['pop'] = sd['data'].apply(findPop)

In [44]:
sd.head()

,data,year,state,fips,race,origin,sex,age,pop
0,1969AL01001991910000000159,1969,AL,01001,white,not applicable,Male,0 years,159
1,1969AL01001991910100000657,1969,AL,01001,white,not applicable,Male,1-4 years,657
2,1969AL01001991910200001137,1969,AL,01001,white,not applicable,Male,5-9 years,1137
3,1969AL01001991910300000956,1969,AL,01001,white,not applicable,Male,10-14 years,956
4,1969AL01001991910400000721,1969,AL,01001,white,not applicable,Male,15-19 years,721

In [45]:
str1 = '0000159'
rs = str1.strip('0')
rs

'159'

In [46]:
sd.tail()

,data,year,state,fips,race,origin,sex,age,pop
1821737,2020WY56045993921400000021,2020,WY,56045,other,not applicable,Female,65-69 years,21
1821738,2020WY56045993921500000002,2020,WY,56045,other,not applicable,Female,70-74 years,2
1821739,2020WY56045993921600000002,2020,WY,56045,other,not applicable,Female,75-79 years,2
1821740,2020WY56045993921700000002,2020,WY,56045,other,not applicable,Female,80-84 years,2
1821741,2020WY56045993921800000002,2020,WY,56045,other,not applicable,Female,over 85 years,2

In [47]:
sd['pop'] = sd['pop'].astype(int)
sd.head()

,data,year,state,fips,race,origin,sex,age,pop
0,1969AL01001991910000000159,1969,AL,01001,white,not applicable,Male,0 years,159
1,1969AL01001991910100000657,1969,AL,01001,white,not applicable,Male,1-4 years,657
2,1969AL01001991910200001137,1969,AL,01001,white,not applicable,Male,5-9 years,1137
3,1969AL01001991910300000956,1969,AL,01001,white,not applicable,Male,10-14 years,956
4,1969AL01001991910400000721,1969,AL,01001,white,not applicable,Male,15-19 years,721

In [48]:
sd = sd[['year', 'state', 'fips', 'race', 'sex', 'age', 'pop']]
sd.head()

   year state   fips   race   sex          age   pop
0  1969    AL  01001  white  Male      0 years   159
1  1969    AL  01001  white  Male    1-4 years   657
2  1969    AL  01001  white  Male    5-9 years  1137
3  1969    AL  01001  white  Male  10-14 years   956
4  1969    AL  01001  white  Male  15-19 years   721

In [49]:
sd.to_csv('population_detailed_1969-2020.csv')

In [50]:
sd_county = sd.groupby(['year','fips']).sum()
sd_county = sd_county.reset_index()
sd_county.head()

   year   fips    pop
0  1969  01001  22289
1  1969  01003  53425
2  1969  01005  20120
3  1969  01007  13586
4  1969  01009  19544

In [51]:
sd_county.shape

(162334, 3)

In [52]:
sd_county.to_csv('pop_1969-2020.csv')